Repository: mozilla-l10n/mt-training-data
Catalog: odk/odk_pontoon.tmx
Source language: en_us
Languages: odk

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
odk: ڏُوجِيان </strong> تجوِيزان <strong> چا ترجما انگريزِي ۾ ڇَي۔ پَر تمهِين ڏيک سِگھا ڇَوا۔ لِنڪ شامل ڪرا</strong> سِيٽنگان <strong> آئِيڪُن، پڇي </strong> پروفائِيل<strong> ٻولِيان ۾ ڪِلڪ ڪرا۔ جڪو بِي ٻولِيا تمهِين ٻولا ڇَوا۔ ترِي چي سجي هٿا چي ڪُنڊِي ۾ ترجمان چِي ڪُنڊي ۾ هيڪ فهرست هُوِي جڪا </strong> Locales <strong> ڪيهلَي جا ڇَي۔ ترجما هيڪي ڏِيها کن پڇي سائِيٽِي پر ڏيکاڻَي ڇَي۔

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
odk: ڪامن وائِيس سائِيٽِي چا ترجما <strong>پون ٽونا</strong> پرهُوَي ڇَي۔

source: Try again by dragging your file here
odk: آپڪِي فائِيلِي نُون اِٺي ڇڪتِي بڙتِي ڪوشش ڪرا

source: Try uploading again
odk: بڙتِي اپلوڊ ڪرڻي چي ڪوشش ڪرا

source: Tshivenda
odk: شيوينڊا

source: Tunen
odk: ٽُونين

source: Tupuri
odk: ٽپورِي

source: Turkish
odk: تُرڪِي

source: Turkmen
odk: تُرڪمانِي

source: Tush
odk: تَش

source: Tuvan
odk: تووان

source: Twi
odk: ٽوئِي

source: Typically megabytes
odk: عام ميگا بائِيٽس

source: Ubykh
odk: اوبيخ

source: Udmurt
odk: ادمورت

source: Ukrainian
odk: يُوڪرينِي

source: Understand contribution criteria
odk: حِصا گيهڻي چي معيارا نُون سمجھا

source: Understand how to contribute and validate on the Common Voice dataset
odk: سمجھا تہ ڪامن وائِيس ڊيٽا سيٽا ۾ جُملان ائُون آڊيو ڪِلپسا نُون ڪِيُون تعاون ائُون تصدِيق ڪجَي ڇَي۔

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
odk: سمجھا تہ ڪا ڏيکڻ کپَي جِڏ آوازا چي ڪِلپس سُڻتا ڇوا ائُون آپڪي آوازا چِي رڪارڊنگِي نُون بڌِيڪ سُٺَي ڪرڻي ۾ مدد ڪرا۔

source: Universities, Academics and Researchers
odk: يُونِيورسٽِيا، تعلِيم ائُون محقق

source: Upload aborted. Do you want to delete your recordings?
odk: اَپ لوڊ روڪلَي گيلَي۔ ڪا تمهِين آپڪِي رڪارڊنگ ختم ڪرڻ چاهوا ڇَوا؟

source: Upload an image file
odk: هيڪ تصوِير فائِيل اَپ لوڊ ڪرا

source: { $uploadedQuestions } of { $totalQuestions } questions collected
odk: { $uploadedQuestions } سوالان مُون جمع { $totalQuestions } ڪلي گيلي

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
odk: { $uploadedQuestions } سوالان مُون { $totalQuestions } جمع ڪلي گيلي۔ سوال شامل ڪرڻي چي طريقي چي باري ۾ بڌِيڪ جاڻڻي چي ڪاڻ امچي <guidelinesLink> اڳواڻِي ڪرڻي هاڙين خطين</guidelinesLink> صفحي ڏيکا۔

source: { $uploadedSentences } of { $totalSentences } sentences collected
odk: { $uploadedSentences } مُون جُملان نُون جمع ڪلَي گيلَي { $totalSentences }

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
odk: { $uploadedSentences } مُون جُملان نُون ڀيڙَي ڪلَي گيلَي۔ { $totalSentences } هِڪ سِرکان جُملان نُون ڊائُون لوڊ <downloadLink> اِٺي </downloadLink> ڪِلڪ ڪرا۔

source: Upload failed, please retry.
odk: اَپلوڊ ناڪام هُلَي، مهربانِي ڪتِي بڙتِي ڪوشش ڪرا۔

source: Upload <icon></icon> public domain sentences
odk: اَپ لوڊ ڪرا </icon> <icon>عوامِي ڊومينا چي جُملي

source: Upload in progress...
odk: اَپ لوڊ جارِي ڇَي۔۔۔۔۔۔

source: Upload more sentences?
odk: بڌِيڪ جُملي اَپ لوڊ ڪرا؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
odk: اي ڪِلپا چِي اَپ لوڊ سَروَرا پر ناڪام هُوَي ڇَي پلِي۔ صفحي نُون بڙتِي لوڊ ڪرا يان بڙي ٿوڪڙِي ديرِي کن پڇي بڙتِي ڪوشش ڪرا۔

source: Upload of this clip keeps failing, keep retrying?
odk: ها ڪِلپ اَپلوڊ نهِين هُوَي ڇَي پلا، بڙتِي ڪوشش ڪرا؟

source: Urdu
odk: اُردُو

source: Use correct grammar
odk: صحِيح گرامر اِستعمال ڪرا

source: Use correct spelling and grammar
odk: گرامر ائُون صحِيح اکرين اِستعمال ڪرا

source: Use correct spelling and grammar.
odk: صحِيح هِجي ائُون گرامر اِستعمال ڪرا

source: Use correct spelling and punctuation
odk: صحِيح اسپيلنگ ائُون مخصُوص جاءِ اِستعمال ڪرا

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
odk: <mark> ڪُوڙِي تقرِيرِي هاڙي سياق و سباق </mark> چي ڪاڻ فائدي هاڙي ائُون ڪيسز استعمال ڪرا (مثال، جِڏ تمهِين چاهوا ڇَوا تہ ٻولڻي هاڙِي اوڙکاند اُونهان ماڻسان ڀيڙَي ڪام ڪرَي جڪو نقل نہ ڪروڙي ائُون ڏُوجِيا باتا ڪري هِتي)

source: User Name
odk: اِستعمال ڪرڻي هاڙي چَي نان

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
odk: استعمال ڪرڻي هاڙي عطيا ڪروڙي ڪلپان چي صحِيح هُوڻي جي تصديق ڪري هِتي، جانچي هِتي تہ ٻولڻي هاڙي جُملا صحِيح نمُوني پڙهلا ڇَي

source: Ushojo
odk: اُشُوجو

source: Uyghur
odk: اُويگرِي

source: Uzbek
odk: اُزبَڪ

source: Validate
odk: تصدِيق ڪرا

source: Validated Clips
odk: تصدِيق هئوڙي ڪِلپس

source: Validated Hours
odk: تصدِيق هئُوڙا ڪِلاڪ

source: Validated Hr. Total
odk: تصدِيق هُئوڙي ڪُل ڪِلاڪ

source: Validate readings
odk: پڙهڻي چِي تصدِيق ڪرا

source: Validate Readings
odk: مطالعي چِي تصدِيق ڪرا

source: Validate Readings, Review Transcriptions
odk: مطالعي چِي تصدِيق ڪرا، ائُون نقلان چا جائِزا گيهوا

source: Validate Readings <small>(Coming soon)</small>
odk: مطالعي چِي تصدِيق ڪرا<small> (جلدِي آوَي ڇَي چلا) </small>

source: Validate readings submitted by community members
odk: برادري چي ميمبران طرفُون موڪلوڙان مطالعان چِي تصدِيق ڪرا۔

source: Validate user-recorded readings in your language
odk: تمچِي ٻولِي ۾ يُوزرا چي طرفُون رڪارڊ ڪروڙِي مطالعي چِي تصديق ڪرا

source: Validate <validateIcon></validateIcon> does this questions meet the guidelines?
odk: تصديق ڪرا<validateIcon></validateIcon>ڪا ها سوال ھدايتان پر پُورا اترَي ڇَي؟

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
odk: عطيا ڪروڙي ڪِلپسا چِي تصدِيق ڪرڻ ڪامن وائِيسا چِي مشِينِي ڪاڻ لازمِي ڇَي۔ سُڻا ائُون امچِي مدد ڪرا معيارِي اوپن سورس وائِيس ڊيٽا ٺاهوَڻي ۾۔

source: Validation Progress
odk: تصدِيقِي چِي پيش رفت

source: Validations
odk: تصدِيقا other

source: Value and recognition.
odk: قَدر ائُون اوڙکاند

source: Variant Contribution Options
odk: فرق فرق شراڪتِي چي اِختيار

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
odk: متغيرات هيڪ ٻولِي چا هيڪ مخصُوص رُوپ ڇَي۔ مثال جڪو جغرفيائِي يان بڙي برادرِي ۾ ريهڻي هاڙان چي طرفُون بانٽلي جائي هِتي۔ ڪِڏ ڪِڏ ويهچ باتا بِي ڪيهڙاجي هِتِيا۔

source: Varying Pronunciations
odk: مختلف تلفظ

source: Venetian
odk: وينيٽين

source: Version
odk: نُسخا

source: Very common mistakes include:
odk: تمام عام غلطِيا شامل هِتِيا۔

source: Vietnamese
odk: ويتنامِي

source: View your progress against personal and project goals.
odk: ذاتِي ائُون منصُوبي چي مقصدان چي برخلاف تمهِين پيشرفت ڏيکا۔

source: Visible
odk: ظاهر

source: Voice clips are entered into a submission queue that readies them for listening.
odk: آوازا چي ڪلپ ڀيڙي ڪرڻي هاڙِي قطارِي ۾ داخل ڪلي جائي هِتي، جڪو اُونهان نُون سُڻڻي ڪاڻ تيار ڪري هِتي۔

source: Voice Collection
odk: آوازا چا مجمُوعا

source: Voice Contribution
odk: حصي ۾ آواز ڏِيڻ

source: Voice Dataset, Ready for Download
odk: ڊائُون لوڊ ڪرڻي ڪاڻ تيار وائِيس ڊيٽا سيٽ۔

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
odk: آواز قُدرتِي ڇَي، آواز اِنسانِي ڇَي۔ ايڇي ڪاڻ اَمهِين قابل اِستعمال آواز ٽيڪنالاجِي ٺاهوَڻي چي باري ۾ پُرجوش ڇئُون۔ اَمچِي مشِينِي چي ڪاڻ، پَر آواز سسٽم ٺاهوَڻي ڪاڻ ڊولپرزا نُون آواز ڊيٽائِي چي موٽي مقدارا چِي ضرُورت ڇَي۔

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
odk: آواز قُدرتِي ڇَي، آواز اِنسانِي ڇَي۔ ايڇي ڪاڻ اَمهان نُون قابل آواز اِستعمال ٺاهوَڻي چي ڪاڻ دِلچسپِي ڇي۔ اَمچِي مشِينِي چي ڪاڻ ٽيڪنالاجِي پر آواز سسٽم ٺاهوَڻي ڪاڻ، آوازا چا هيڪ تمام موٽِي ڊيٽائِي چِي ضرُورت ڇَي۔

source: Voices Online Now
odk: اِمهين آن لائِين آواز

source: Voice Validation
odk: آوازا چِي تصدِيق

source: Volume
odk: آواز، (مقدار)

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
odk: VoxForge نُون مُخت ائُون اوپن سورس تقرِير اوڙکڻي هاڙِي انجڻِي سُون اِستعمال ڪرڻي ڪاڻ نقل ڪروڙِي تقرير ڀيڙَي ڪرڻي ڪاڻ قائم ڪلَي گيلَي ڇَي

source: Wakhi
odk: واکِي

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
odk: ڪامن وائِيسا نُون بڌيڪ سُٺَي ٺاهوڻي ۾ مدد ڪرن چاهوا ڇوا؟ زبردست! اِي ميلِي يان <discourseLink> Discourse </discourseLink> فورمان چي ذريعي رابطا ڪرا، سائيٽا چي مسئلان نُون<githubLink>GitHub</githubLink> پر جمع ڪرا، يان <matrixLink>Matrix</matrixLink> ڪميونٽي چيٽا ۾ شامل هُوا۔

source: Want to save your information? <createProfile>Create a profile</createProfile>
odk: تمهِين معلُومات محفُوظ ڪرڻ چاهوا ڇَوا؟ <createProfile>پروفائِيل ٺاهوا<createProfile>

source: Want to stay in touch with Common Voice?
odk: ڪا تمهِين ڪامن وائِيسا سُون رابطي ۾ ريهڻ چاهوا ڇوا؟

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
odk: جِڏ اَمهِين ڪامن وائِيس ڊيٽا سيٽا چا نَوان نُسخا جارِي ڪرُون تِڏ صفا نَوِيان خبرا چاهُون ڇَئُون؟ امچي نيوز ليٽرا چِي ڄاڻ حاصل ڪرا۔

source: Watch our video explainer to help
odk: مددِي چي ڪاڻ اَمچِي وضاحت ڪرڻي هاڙِي وِيڊيو ڏيکا

source: Wayuunaiki
odk: وايونائِيڪِي

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
odk: اَمهِين سدائِين ڊيٽا ڏيڻي هاڙان ماڻسان کن اُونهان چي ضرُوتان چي حوالي سُون سُڻڻي چي ڪاڻ ڪوشش ڪرُون ڇئُون۔ ڊيٽا ڀيڙِي ڪرڻي هاڙي پليٽ فارما پر تعاون ڪرڻي جھالتِي ڊيٽائِي چِي صحتِي چِي شِڪل ٺاهوَڻي تاڻِين، اَمهِين تمهان کن </emailFragment> سُڻڻ چاهُون ڇئُون <emailFragment>۔

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
odk: اَمهِين آوازا چا هيڪ کُلوڙا ائُون عوامِي چي ڪاڻ ميهلوڙا ڊيٽا سيٽ ٺاهُون ڇئُون پلي، جڪا نُون هر ڪو اِستعمال ڪر سِگھَي ڇَي تقرِيري، ڪام ڪرڻي هاڙِي ايپلِيڪيشنِي نُون ترتِيب ڏيڻي ڪاڻ۔

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
odk: اَمهِين ٽيڪنالاجِي، تازِي ائُون نَوِين ٻولِي چي حقان ۾ عوامِي شعبي چي مصرُوفيت چِي طرفدارِي ڪرڻي چي ڪاڻ پُرجوش ڇَئُون۔ جي اگر تمهِين هيڪ موٽا پروجيڪٽ يان بڙي مهم هلاوَڻي چي ڪاڻ رٿ ڪرا ڇَوا پلي، مهربانِي ڪتِي </emailFragment> رابطا ڪرا <emailFragment>۔

source: We are going out to get a coffee.
odk: اَمهِين ڪافِي گيهڻي ڪاڻ ٻاهر جائُون ڇئُون چلي۔

source: We are going out to get coffee.
odk: اَمهِين ڪافِي گيهڻي ڪاڻ ٻاهر جائُون ڇئُون چلي۔

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
odk: اَمهِين ماڻسان نُون آپڪِي جنس يان بڙي صنفِي شناختِي چي باري ۾ جڪو ڪهِين سُڻائُون ڇَئُون اي منجھ اُونهان نُون بڌِيڪ چُونڊڻي چي ڪاڻ بڌِيڪ اختيار پيش ڪرُون ڇَئُون پلي۔ مهربانِي ڪتِي آپڪي آپا نُون اي اندازا ۾ بيان ڪرا جڪو تمهان نُون قدرتِي محسُوس هُوَي ڇَي۔ <learnMoreLink> جِنس ائُون جِنسِي چي باري ۾ زور ڏيڻي ڪاڻ بڌِيڪ جاڻا۔ </learnMoreLink>

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
odk: موزِيلا پر آوازا هاڙِي ٽيڪنالاجِي چي چوڌارِيُون هيڪ بِرادرِي ٺاهُون ڇَئُون پلي۔ اَمهِين تازا ڪارِيان، نَوِين ڊيٽائِي چي وسِيلان سُون رابطي ۾ ريهڻ چاهُون ڇَئُون ائُون اڃا بڌِيڪ سُڻڻي ڪاڻ تہ تمهِين جي ڊيٽائِي نُون ڪِيُون اِستعمال ڪرا ڇَوا پلي۔

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
odk: اَمهِين يقِين راکُون ڇَئُون تہ موٽي ائُون عوامي طورا پر ميهلوڙي آوازا ڊيٽا سيٽ مشِينِي چِي سِکائِي پر پڙوڙِي تقرِير ٽيڪنالاجِي چِي جفا ڪشِي ائُون صحتِي هاڙي مقابلي نُون اهميت ڏِيئَي ڇَي۔ ها هيڪ عالمِي ڪوشش ڇَي ائُون اَمهِين ڪُلان نُون آوَڻي چِي دعوت ڏِيئُون ڇَئُو۔ امچا مقصد تقرِيري ٽيڪنالاجِي نُون بڌِيڪ شامل ڪرڻي ۾ مدد ڏِيئڻ ڇَي، جڪو دُنيائِي چي آوازان چي تنوعا نُون ظاهر ڪرهِي۔

source: Website Localization
odk: ويب سائِيٽ نُون لوڪل ٺاهوڻ

source: Websites
odk: ويب سائِيٽا

source: We couldn’t find that page for you
odk: اَمهِين تمچي ڪاڻ اوهچ صفحا ڪونهِي سوڌ سِگھلي

source: We couldn’t get any audio clips for you to listen to. Please try again later.
odk: اَمهِين تمچي ڪاڻ سُڻڻي لاءِ ڪو بِي آڊيو ڪِلپ حاصل ڪونهِي ڪر سِگھلي۔ مهربانِي ڪتِي بڙي بڙتِي ڪوشش ڪرا۔

source: We couldn’t get any sentences for you to speak. Please try again later.
odk: اَمهِين تمچي ٻولڻي ڪاڻ ڪو بِي جُملي حاصل ڪونهِي ڪر سِگھلي ڇَئُون۔ مهربانِي ڪتِي ٿوڪڙَي ترسا ائُون پڇي بڙتِي ڪوشش ڪرا۔

source: Weekly
odk: هفتي وار (هر هفتي)

source: Weekly Goal
odk: هفتي چي مقصد

source: We launch the Common Voice site in this language.
odk: امهِين جي ٻولِي ۾ ڪامن وائس ويب سائيٽ شرُوع ڪرُون ڇئُون۔

source: Welcome { $company } staff!
odk: اِسٽاف { $company } جِي ڪتِي آلَي۔

source: Welcome to Common Voice
odk: ڪامن وائِيسا ۾ ڀلِيڪار

source: Welcome to Spontaneous Speech
odk: ڪُوڙِي تقرِيرِي ۾ ڀلِيڪار

source: Welsh
odk: ويلشِي

source: We may have run out of clips - refresh the page, or try again later.
odk: اَمهان کن ڪِلپ ختم هُتِي گيلي هِتي، صُفحا رِيفريش ڪرا، يان پڇي بڙتِي ڪوشش ڪرا۔

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
odk: اَمهان نُون شايد واهچ درخواست ڪونهِي مِللِي ڇَي۔ مهربانِي ڪتِي اَمهان نُون سِڌِي سَنوِي اِي ميل ڪرا</emailLink> ائُون اَمهِين تمهان ڏِسِين پُوٺي آوهُون۔{ $email } <emailLink>

source: We periodically release the dataset
odk: اَمهِين ٽيم ٽيما پر ڊيٽا سيٽ جارِي ڪرُون ڇَئُون۔

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
odk: <privacyLink> اَمهِين تمچِي معلُومات خيالا سُون سنڀالڻي چا وچن ڪرُون ڇَئُون۔ بڌِيڪ امچا رازدارِي هاڙا نوٽس پڙها۔</privacyLink>

source: We’re building a multi-language, open-source voice dataset for training speech-enabled applications.
odk: اَمهِين هيڪ کُلوڙا ذريعا ٺاهُون ڇَئُون پلي، گھڻِيا ئِي ٻولِيان چي آواز ڊيٽا سيٽ جڪو هر ڪو اِستعمال ڪر سِگھَي ڇَي، ڪام ڪرڻي هاڙِي ايپلِيڪيشنِي نُون ترتيب ڏِيئڻي ڪاڻ۔

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
odk: امهِين آوازان چا اوپن سورس ڊيٽا سيٽ ڀيڙا ڪرُون ڇئُون پلي. آپڪا آواز عطيا ڪرا، ڏُوجان ماڻسان چي ڪلِپ چي صحِيح هُوڻي چِي تصدِيق ڪرا، ائُون ڊيٽا سيٽا نُون سِگڙان چي ڪڻ بڌِيڪ سُٺَي ٺاهوا.

source: We’re experiencing unexpected downtime
odk: اَمهِين سسٽم بند هُوڻي چا تجربا ڪرُون ڇئُون پلي

source: We're going out to get coffee.
odk: اَمهِين ٻاهر جائُون ڇَئُون چلي ڪوفِي گيهڻي چي ڪاڻ۔

source: We’re going out to get coffee.
odk: اَمهِين ڪافِي گيهڻي ڪاڻ ٻاهر جائُون ڇئُون چلي۔

source: We release the dataset every 3 months.
odk: امهِين هر تِيجي مهِيني ۾ ڊيٽا شِيٽ جارِي ڪرُون ڇئُون۔

source: We're making some big changes
odk: امهِين ڪهِين موٽِي مٽا سٽا ڪرُون ڇَئُون پلي۔

source: We're receiving a lot of traffic and are currently investigating the issues.
odk: اَمهِين تمام گھڻَي آَوَڻي جاڻي چي ڪاڻ ڪتِي جي مهلِي مسئلان چِي جانچ ڪرُون ڇئُون پلي۔

source: We’re sorry, your platform is not currently supported.
odk: اَمهان نُون معاف ڪرا، تمچَي پليٽ فارم اِمهين سپورٽ ڪونهِي ڪرَي ڇَي

source: Western Highland Purepecha
odk: ويسٽرن هائِي لينڊ پوريچا

source: Western Penan
odk: آنٿوڻي هاڙِي پينان

source: Western Sierra Puebla Nahuatl
odk: آنٿوڻي هاڙِي سيرا پيلائِي نو هوٽلائِي

source: Westphalian
odk: ويسٽفَلِيئن

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
odk: اَمهِين ترجمان چي ڪاڻ موزيلا ٽول اِستعمال ڪرُون ڇئُون، جڪا نُون <pontoonLink>پونٽون</pontoonLink> ڪيهلَي جا ڇَي۔ پونٽونا ۾ گھڻِيا ئِي ٻولِيا هِتِيا، جي تمچِي ٻولِي ڪونهِي تہ تمهِين </pontooniRequestLnk> پر درخواست ڏي سِگھا ڇَوا تئ تمچِي ٻولِي شامل هُوَئ <pontoonRequestLink>۔ او کن پڇي، ٻولِي نُون ڪامن وائِيسا چي پروجيڪٽا ۾ ناکڻي ڪاڻ </githubRepoLink> نَوِي ٻولِي شامل ڪرڻي چِي درخواست ڏِيا <githubRepoLink>۔ </localizationFragment> سائِيٽِي چي ترجمي ۾ بڌِيڪ ڏيکا</localizationFragment>۔

source: We’ve made some changes. Delta Segments just contain the most recent clips since the last release. <deltaLink>Read more about this work</deltaLink>.
odk: اَمهِين ڪهِين مٽا سٽا ڪلِي ڇَي </deltaLink> ايڇي بابت بڌِيڪ پڙها۔ <deltaLink> ڊيلٽا حِصا رُگا تازي ڪِلپسا کن ڪتِي آخرِي ڪِلپسا تاڻِين هُوَي ڇَي۔

source: We've run out of sentences to record in this language...
odk: اَمهان کن جي ٻولِي ۾ رڪارڊنگ چي ڪاڻ جملي ختم هُتِي گيلي هِتي۔

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
odk: اَمهِين چاهُون ڇئُون تہ تقرِيرِي چي ماڊل سُٺي هُوِي تہ ٻولڻي هاڙان چِي مٽ مٽ رينجِي ۾۔ جھُونچ هُوَڻي ڪاڻ، هيڪي آواز ڊيٽاسيٽا نُون گھڻا ئِي فرق فرق ماڻسان چِي اڳواڻِي ڪرڻ کپَي۔

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
odk: اَمهِين چاهُون ڇئُون تہ مشِين لرننگ الگورٿمز فرق فرق پس منظرا نُون سمجھ سِگھَي، ائُون آراما سُون تيز آوازا نُون بِي سمجھ سِگھي هِتي۔ جيسِي تاڻِين وي تمهان نُون پُورا جُملا سُڻڻي کن نہ جھلس۔ هلڪِي پس منظرا هاڙِي موسيقِي صحِيح ڇَي، اِسڙِي تيز موسيقِي جڪو جڪو هر لفظ سُڻڻي کن جھلَي، واهچ قبُول ڪونهِي ڇَي۔

source: We welcome different accents! Be very cautious before rejecting a clip on the ground that you think the reader has mispronounced a word, has put the stress in the wrong place, or has ignored punctuation. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a generous margin of appreciation for those who may speak differently from you.
odk: اَمهِين فرق فرق اُچارا نُون ڀلِيڪار ڪرُون ڇئُون۔ ڌرتِي پر ڪو بِي ڪِلپا نُون رد ڪرڻي کن پيهڻُون گھڻا خيال راکا ائُون تمهِين سوچا تہ پڙهڻي هاڙي ڪو بِي لفظ غلط اِستعمال ڪلا ڇَي، دٻاء نُون غلط جائِي پر ميلهلَي گيلَي ڇَي، يان بڙي خيراتِي هاڙِي جائِي نُون نظر انداز ڪلَي گيلَي ڇَي۔ سجِي دُنِيائِي ۾ اِستعمال هُوَڻي هاڙي اُچار فرق فرق قِسمان چي هِتي۔ جڪا مُون متان تمهِين آپڪِي مقامِي برادرِي ۾ سُڻلي هُوَي۔ مهربانِي ڪتِي اُونهان چي ڪاڻ قدردانِي هاڙِي سخاوت ڏِيا، جڪو تمهان کن فرق فرق ٻول سِگھي هِتي۔

source: We will be in touch with more information about how to add your language to Common Voice very soon.
odk: امهِين تمچِي ٻولِي نُون ڪامن وائسا ۾ شامل ڪرڻي ڪاڻ تڪڙي تمهان سُون رابطا ڪرهُون۔

source: We will be in touch with more information as it becomes available.
odk: اَمهِين بڌِيڪ معلُوماتِي چي ڪاڻ رابطي ۾ ريهُون جُون واهچ آوهِي۔

source: We will not make your email public.
odk: اَمهِين تمچِي اِي ميلِي نُون عوامِي ڪونهِي ڪرُون۔

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
odk: اَمهِين ڊيٽا سيٽا مُون تمچي آوازا چِي رڪارڊنگ هٽاوَڻي ڪاڻ تمچِي درخواستِي چا جائِزا گيهُون۔ جي اگر تمچِي درخواست منظُور ڪلِي گيلِي ڇَي، اَمهِين اُونهان سُون رابطا ڪرهُون جِڻهين ڊيٽاسيٽ ڊائُون لوڊ ڪلِي ڇَي ائُون درخواست ڪرهُون تہ ويهچ تمچي آوازا چِي رڪارڊنگِي نُون هٽاتِي ڇوڙِي۔

source: We will show you a prompt or question
odk: اَمهِين تمهان نُون هيڪ اِشارا يان بڙي سوال ڏِکاڻهُون۔

source: We work with foundations, civil society and community partners to make the internet a healthier place, with a particular focus on East Africa. Learn more about our <programmaticWork>programmatic work.</programmaticWork>
odk: اَمهِين بُنيادان، سِول سوسائِيٽِي ائُون برادرِي چي ڀائِيواران سُون بِچڙتِي ڪام ڪرُون ڇئُون انٽرنيٽا نُون هيڪي پروگراما هاڙي ڪاما <programmaticWork> صحتمند جاءِ، خاص ڌِيانا سُون اوڀر آفرِيڪا پر، امچي باري ۾ بڌِيڪ جاڻا </programmaticWork>۔

source: What is a language on Common Voice?
odk: ڪامن وائِيسا ۾ ٻولِي ڪا ڇَي؟

source: What issues are you experiencing with this content?
odk: اي موادا سُون تمهان نُون ڪِسي مسئلي هُوي هِتي پلي؟

source: What issues are you experiencing with this sentence?
odk: تمهِين اي جُملي سُون ڪِسِيا ڏُکيائِيا محسُوس ڪرا ڇوا پلي؟

source: What is your age?
odk: تُڌِي عمر ڪا ڇَي؟

source: What is your sex or gender?
odk: تُڌِي جنس يان بڙي جنس ڪا ڇَي؟

source: What kind of goal do you want to build?
odk: تمهِين ڪِسي قسما چي مقصد ٺاهوڻ چاهوا ڇوا؟

source: What makes a good question?
odk: ڪا هيڪ سُٺا سوال ڪرَِي ڇَي؟

source: What needs to be in my file?
odk: مانڇِي فائِيلِي ۾ ڪا هُوَڻ کپَي؟

source: What questions can I add?
odk: مين ڪِسي سوال شامل ڪر سِگھَين ڇَين؟

source: What sentences can I add?
odk: مين ڪِسي جُملي شامل ڪر سِگھَين ڇَين؟

source: What’s inside the Common Voice dataset?
odk: ڪامن وائِيسا چي ڊيٽا سيٽا منجھ ڪا ڇَي؟

source: What's Public?
odk: عوامِي ڪا ڇَي؟

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
odk: جِڏ ڪو استعمال ڪرڻي هاڙا آوازا جي ڪِلپا نُون رد ڪرَي ڇَي تہ اوهچ قطارا ۾ پُوٺَي جا ڇَي۔ جِڏ ڏُوجي چڪر رد ڪجَي ڇَي تہ آوازا چا ڪِلپ ”ڪِلپ گريو يارڊا“ ۾ منتقل هُتِي جا ڇَي۔

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
odk: گھڻِيا عام غلطِيا جُون هُو سِگھي هِتِيا، سُڻڻي ۾ مهلِي بُلڪُل پڪ ڪرا تہ جڪو رڪارڊ ڪلَي گيلَي ڇَي، اُونهچ بِڪُل اُونهچ ئِي هُوَي جڪو لِکوڙَي ڇَي۔ جي اگر ڌاڪڙِِيا بِي غلطِيا هُوِي تہ اُونهان نُون نظرانداز ڪرا۔

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
odk: جِڏ تمهِين آپڪِي رڪارڊنگِي چِي درخواست ڏِيا ڇَوا، اَمهِين اُونهان نُون گھڻِيا زِپ فائِيلان ۾ ڀيڙَي ڪرُون ڇَئُون۔ اِٺي تمچِيا پُراڻِيا درخواستا پلِيا هِتِيا۔

source: Which variant of { $language } do you speak?
odk: { $language } تمهِين ڪِسي قِسما چِي ٻولِي ٻولا ڇَوا؟

source: Why ?
odk: ڪان؟

source: Why a profile?
odk: پروفائِيل ڪان؟

source: Why are you asking?
odk: ڪان پُوڇي هِتا پلا؟

source: Why Common Voice?
odk: ڪان ڪامن وائِيس؟
